<?php

$filename = 'D:\\PHP-Practise\\7.File\\rw-file\\write.txt';

$existingData = file_get_contents( $filename );

/* insert one data in the write.txt file */
$fp = fopen( $filename, 'w' );
fwrite( $fp, "Sakib\n" );
fwrite( $fp, "Tamin\n" );
fwrite( $fp, "Mustafiz\n" );
// fwrite( $fp, $existingData );
// fwrite( $fp, "Miraz\n" );
// fwrite( $fp, "Naim\n" );
fclose( $fp );

// ফাইল সিস্টেম মোড যদি w হয় তাহলে সেটা একবারে কিছু ডাটা অ্যাড করার জন্য ভাল। কিন্তু আমরা যদি চাই প্রথমে কিছু ডাটা অ্যাড করে আবার পরে আর কিছু ডাটা w মোডে থেকেই অ্যাড করবো তাহলে সমস্যা আছে।

// কারণ w মোডে থেকে দ্বিতীয় বার ডাটা অ্যাড করতে গেলে সে প্রথম বারের সকল ডাটাগুলোকে রিমুভ করে দিয়ে দ্বিতীয় বারের ডাটা গুলোকে অ্যাড করে। আবার যদি তৃতীয় বারে কিছু ডাটা অ্যাড করা হয় তাহলে সে দ্বিতীয় বারের সকল ডাটাকে রিমুভ করে দিবে এবং পরের তৃতীয় বারের ডাটাগুলো অ্যাড করবে। এটা একটা সমস্যা.............

// এই সমস্যা এরানোর জন্য প্রথম বারের ডাটাগুলো পড়ে নিতে হবে এবং পরে দ্বিতীয় বারে আবার ডাটা অ্যাড করতে হবে।

// উপরের এই পুরো প্রোসেসটাকে আরও সহজে করার জন্য a মোড ব্যবহার করা ভাল। তখন আর file_get_contents করে ডাটা পড়া লাগবে না। তখন শুধু একটার পর একটা ডাটা অ্যাড করে গেলেই হবে।
