<?php

$filename = "d:\\PHP-Practise\\7.File\\rw-file\\7.5.txt";

// file_put_contents(name of file, data);

file_put_contents( $filename, "Musfiq\n", FILE_APPEND | LOCK_EX );
file_put_contents( $filename, "Naim\n", FILE_APPEND | LOCK_EX );

// file_put_contents ফাইলের মধ্যে ডাটাগুলোকে সরাসরি লিখে ফেলে আগের ডাটাগুলোকে সংক্ষণ করে না (by default)। এখন যদি আগের ডাটাগুলো রেখে তারপর ডাটা অ্যাড করতে চাই তাহলে ৩য় প্যারামিটারে FILE_APPEND লিখতে হবে।

// একাধিক ইউজার যদি একসাথে একটি ফাইলে ডাটা ইনপুট করতে থাকে তাহলে অনেক ধরণের সমস্যা হতে পারে। যেমন: যে ডাটাটা আগে ইনপুট করা হয়ে হয়েছে সেটা পরে আসতে পারে আবার যে ডাটাটা পরে ইনপুট করা হয়েছে সেটা আগে আসতে পারে। এই রকম আরো বিভিন্ন ধরনের সমস্যা হতে পারে। এই সকল সমস্যা থেকে পরিত্রান পাওয়া জন্য LOCK_EX ব্যবহার করা হয়।

// তখন একটা প্রোসেস চলার আগ পর্যন্ত ফাইল লক হয়ে থাকে। যখনই কাজ শেষ হয়ে যায় তখনই লকটা ছেড়ে দেয়। এবং পরবর্তী প্রোসেসগুলো চলতে শুরু করে।

// লেখার সময় LOCK_EX
// পড়ার সময় LOCK_SH